1tontech.angular-material
aixcoder-plugin.aixcoder
amazonwebservices.aws-toolkit-vscode
aminer.codegeex
anthropic.claude-code
bito.bito
bradgashler.htmltagwrap
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codeium.codeium
codium.codium
cyrilletuzi.angular-schematics
dbaeumer.vscode-eslint
docker.docker
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
fabiospampinato.vscode-terminals
formulahendry.auto-rename-tag
github.codespaces
github.copilot
github.copilot-chat
github.copilot-labs
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
ibm.output-colorizer
mattpocock.ts-error-translator
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.azure-repos
ms-vscode.live-server
ms-vscode.remote-repositories
ms-vsliveshare.vsliveshare
natqe.reload
naumovs.color-highlight
oderwat.indent-rainbow
pmneo.tsimporter
redhat.vscode-yaml
sonarsource.sonarlint-vscode
svelte.svelte-vscode
vincaslt.highlight-matching-tag
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
visualstudioexptteam.vscodeintellicode-completions
wesbos.theme-cobalt2
willluke.nextjs
yoavbls.pretty-ts-errors
zignd.html-css-class-completion
